Dlubal.RFEM5.MemberType
Type of member

Dlubal.RFEM5.MemberType.UnknownMemberType
Unknown member type

Dlubal.RFEM5.MemberType.Beam
Beam

Dlubal.RFEM5.MemberType.Rigid
Rigid

Dlubal.RFEM5.MemberType.RibType
Rib

Dlubal.RFEM5.MemberType.Truss
Truss

Dlubal.RFEM5.MemberType.TrussOnlyN
Truss (only N)

Dlubal.RFEM5.MemberType.Tension
Tension

Dlubal.RFEM5.MemberType.Compression
Compression

Dlubal.RFEM5.MemberType.Buckling
Buckling

Dlubal.RFEM5.MemberType.Cable
Cable

Dlubal.RFEM5.MemberType.CableOnPulleys
Cable on pulleys

Dlubal.RFEM5.MemberType.ResultBeamType
Result beam

Dlubal.RFEM5.MemberType.DefinableStiffness
Definable stiffness

Dlubal.RFEM5.MemberType.CouplingRigidRigid
Coupling Rigid-Rigid

Dlubal.RFEM5.MemberType.CouplingRigidHinge
Coupling Rigid-Hinge

Dlubal.RFEM5.MemberType.CouplingHingeHinge
Coupling Hinge-Hinge

Dlubal.RFEM5.MemberType.CouplingHingeRigid
Coupling Hinge-Rigid

Dlubal.RFEM5.MemberType.Spring
Spring

Dlubal.RFEM5.MemberType.NullMember
Null